<?php
/**
 * Description: 自定义系统相关配置
 * User: varphper
 * Date: 2018/9/3
 * Time: 20:28
 * Email: varphper@gmail.com
 */

return [
    // +----------------------------------------------------------------------
    // | AES加密设置
    // +----------------------------------------------------------------------
    'aes_key' => '59613e2acc3ce8bf',//Aes加密解密key 共16个字符
    //'aes_iv' => '9b45776a59613e2a',//aes-128-cbc加密向量长度为16，openssl_cipher_iv_length可获取相应加密模式的长度，已修改为动态生成

    // +----------------------------------------------------------------------
    // | md5加密设置
    // +----------------------------------------------------------------------
    'salt' => 'sdfjljafl!ahsdfhauf87798#sdff~',//md5加密盐

    // +----------------------------------------------------------------------
    // | 签名相关设置
    // +----------------------------------------------------------------------
    'device_type' => [1,2,3,4],//设备类型(1:IOS,2:Android,3:web,4:C#PC客户端)
    'sign_life' => 30,//每次请求数据有效时长（秒）
    'sign_cache_time' => 40,//请求数据缓存时间（秒）
    'agency_info_cache_time' => 120,//机构信息缓存时间

];