<?php
/**
 * Description: Created by PhpStorm.
 * User: varphper
 * Date: 2018/9/3
 * Time: 11:45
 * Email: varphper@gmail.com
 */

// +----------------------------------------------------------------------
// | 彩种代码设置(这个先记到这里，之后放缓存或采用其它处理方式)
// +----------------------------------------------------------------------

return [
    //彩种玩法代码及名称
    //"彩种代码1"=>["中文名称","字母简称"]
    "game"=>[
        "3"=>["超级大乐透","dlt"],
        "01"=>["排列3","pl3"],
        "0101"=>["排列5","pl5"],
        "05"=>["22选5","eex5"],
        "06"=>["七星彩","qxc"],
        "31"=>["14场胜负","sfc14"],
        "32"=>["任选9场","r9"],
        "33"=>["6场半全场","lcbqc"],
        "34"=>["4场进球","scjq"],
        "11"=>["竞足胜平负","zqspf"],
        "16"=>["竞足让球胜平负","zqrqspf"],
        "14"=>["竞足比分","zqbf"],
        "12"=>["竞足半全场胜平负","zqbqspf"],
        "13"=>["竞足总进球","zqzjq"],
        "19"=>["竞足混关","zqhhgg"],
        "21"=>["竞篮胜负","lqsf"],
        "22"=>["竞篮让分胜负","lqrfsf"],
        "23"=>["竞篮胜分差","lqsfc"],
        "24"=>["竞篮大小分","lqdxf"],
        "29"=>["竞篮混关","lqhhgg"]
    ],

    //M串N及自由过关玩法分票计算表
    "mxn"=>[

    ],

    //彩票机界面上彩种顺序
    "game_ui_order"=>[

    ],

    //竞彩彩种投注结果对应彩种代码表2，为出票设备规定，用于投注内容，
    "game_result_code"=>[

    ],
    //竞彩彩种代码表为出票设备规定，用于投注内容，
    "sporttery_code"=>[

    ]

];